#### Terraform working directory 🏠: `demo/demo-account/demo-application/cloudwatch-log-group`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.log_groups.data.aws_iam_policy_document.log_group["test-log-group"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "log_group" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
              + "logs:PutLogEventsBatch",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*",
            ]
          + sid       = "LogPublishingToCloudWatchLogGroup"

          + principals {
              + identifiers = [
                  + "es.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.log_groups.aws_cloudwatch_log_group.this["test-log-group"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = "STANDARD"
      + name              = "test-log-group"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "test-log-group"
          + "test" = "test"
        }
      + tags_all          = {
          + "Name" = "test-log-group"
          + "test" = "test"
        }
    }

  # module.log_groups.aws_cloudwatch_log_resource_policy.this["test-log-group"] will be created
  + resource "aws_cloudwatch_log_resource_policy" "this" {
      + id              = (known after apply)
      + policy_document = (known after apply)
      + policy_name     = "test-policy"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
